
//Console.WriteLine("input number");
//int a = Convert.ToInt32(Console.ReadLine());
//System.Console.WriteLine($"Quard of {a}->{a*a}");

// Напишите программу, которая на вход
// принимает два целых числа и проверяет,
// является ли первое число квадратом второго.

// Console.WriteLine("input number 1:");

// int a = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("input number 2:");
// int b = Convert.ToInt32(Console.ReadLine());

// if ( a == b * b) 
// {
//     Console.WriteLine("Да");
// }
// else if (b == a * a)
// {
//     Console.WriteLine("Да");
//     }

// else 
// {
//     Console.WriteLine("Нет");
// }

// Задание 2. Совместная работа
// Семинар 1. Знакомство с языками программирования
// Напишите программу, которая на вход принимает
// целое число N, а на выходе показывает все целые
// числа в промежутке от -N до N.
// Примеры
// 4 => -4, -3, -2, -1, 0, 1, 2, 3, 4
// 2 => -2, -1, 0, 1, 2

// Console.WriteLine("input N:");

// int n = Convert.ToInt32(Console.ReadLine());
// int start = -n;
// while (start <= n)
// {
//     System.Console.Write(start + " ");
//     start++;
// } 

// Напишите программу, которая принимает на вход
// трёхзначное целое число и на выходе показывает сумму
// первой и последней цифры этого числа.


// using System.Globalization;

// Console.WriteLine("input three-digit number: ");

// int num = Convert.ToInt32(Console.ReadLine());

// if (num >= 100 && num <= 999 )
// {
//     int ed = num % 10;
//     int sot = num / 100;
//     System.Console.WriteLine($"Sum of {ed} and {sot} -> {ed + sot}");
// }
// else 
// System.Console.WriteLine("You input not three-digit number");



// Console.WriteLine("input second number:");
// int b = Convert.ToInt32(Console.ReadLine());

// static void CompareNumbers(int firstNumber, int secondNumber)

// Console.WriteLine("input first number:");

// int a = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("input second number:");

// int b = Convert.ToInt32(Console.ReadLine());

//     if (a<b)
//     {
//         Console.WriteLine("второе число больше");
//     }
//     if (b<a)
//     {
//         Console.WriteLine("первое число больше");
//     }
//     if (a==b)
//     {
//         Console.WriteLine("числа равны");
//     }

// System.Console.WriteLine($"{result}");

// Console.WriteLine("Введите первое число a:");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число b:");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите третое число c:");
// int c = Convert.ToInt32(Console.ReadLine());

//     int max = a;
//     if (max < b)
//     {
//        max = b;
//     }
//     if (max < c)
//     {
//       max = c;
//     }
// System.Console.WriteLine(max);

// Console.WriteLine("Введите первое число a:");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число b:");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите третое число c:");
// int c = Convert.ToInt32(Console.ReadLine());

// if (a > b && a > c)
//       {
//         Console.WriteLine(a);
//       }
//       if (b > a && b > c)
//       {
//         Console.WriteLine(b);
//       }
//        if (c > a && c > b)
//       {
//         Console.WriteLine(c);
//       }

      